{
  "gitURL": "URL of the git repository where the Dockerfile of the application can be found. If the repository is public the link has to be the https version, if is private has to be the ssh version)",
  "name": "the application name to be for creating the DNS entry of your application",
  "cloudRepository": "boolean value. If true the Cloud Repository will be deployed along your application",
  "cloudRepoPort": "represent the port number for the Cloud Repository. It will be used by the Kurento-server-repository for talking with MongoDB",
  "qualityOfService": "If enabled it provides dedicated bandwidth levels between KMS instances (optional)",
  "flavor": "defines the size of the KMS instances. MEDIUM has 2 VCPU and LARGE has 4VCPU. The capacity is defined as 100 points for VCPU",
  "ports": "an object that maps the ports that are used from container to the ports that has to be exposed to outside, with relative protocol",
  "replicasNumber": "number of container instances of your applications (different from the KMS number of instances and autoscaling)",
  "secretName (optional)": "the name of the secret that has to be used only if your application is on a private git repository",
  "turnServerActivate": "boolean value to enable the turn server on the mediaserver, if turnServerIp, turnServerUsername and turnServerPassword are not specified the mediaserver will use the default one;",
  "turnServerUrl": "the URL of the turn server if different from the default one (example: 192.168.43.12:8080)",
  "turnServerUsername": "the username of the turn server (mandatory in case is specified the turnServerIp)",
  "turnServerPassword": "the password of the turn server (mandatory in case is specified the turnServerIp)",
  "stunServerActivate": "boolean value to enable the stun server on the mediaserver, if stunServerAddress and stunServerPort are not specified the mediaserver will use the default one;",
  "stunServerAddress": "the stun server ip, if is settled also the stunServerPort has to be settled;",
  "stunServerIp": "the stun server ip, if is settled also the stunServerPort has to be settled;",
  "stunServerPort": "the stun server port (as string), is mandatory if the stunServerAddress is settled",
  "scaleInOut": "the maximum number of KMS instances which will be instantiated runtime by the autoscaling system",
  "scale_out_threshold": "the threshold (in terms of averaged number of points) which will be used for the policy of the autoscaling system. CHECK which flavor you are going to use before define this threshold, and don't put a value lower than the total capacity of your flavor"
}
